/*
 * @Author: lmw
 * @Date: 2022-05-28 14:44:06
 * @LastEditors: lmw
 * @Description:
 */
export const fortuneJson = {
  乾: {
    num: '111111',
    word: '乾卦，主天象，成就事业。卦辞元亨利贞，诸事有利，尤其利于对事业的追求。'
  },
  姤: {
    num: '111110',
    word: '姤卦，主强壮强势的女性。在运的层面也会引申为非分之想。这个运适合越是有想法而锐意进取的人，尤其是对一些看似不合理的越级想法的事务更有利。但是对于求稳定发展，求安逸养生，尤其是对于婚姻感情是不利的。'
  },
  大过: {
    num: '011110',
    word: '大过卦，主过余过分的要求，也有不正常的状态的意思。全卦都是描述的一些反常的现象，其卦辞栋挠，是指主梁都已经弯曲了，还在苦苦坚持。所以说大过作为运卦是一个辛苦艰辛的卦，忙碌劳碌超负荷运转，对于求进步和扩张而言有利，但是对于求稳定现状，循序发展，尤其是对于安逸养生是不利的。'
  },
  鼎: {
    num: '101110',
    word: '鼎卦，主定鼎基业，问鼎天下。所以越是既得利益者，尤其是已经在自己的领域中取得一定成绩的人越是有利。卦辞元吉，亨。是大吉大利，诸事大吉之意。就运而言，鼎卦对各方面都有利，尤其是对于事业的帮助最大。'
  },
  恒: {
    num: '001110',
    word: '恒卦，主恒久永恒，长性坚持。作为运卦更适合长久保持热爱或积极的状态。但恒卦是6爻皆无吉的卦，每个阶段要么艰难，要么有凶险有损失，就如恒卦本身所指的男女情事一样，坚持一件事总是相对困难的。就运而言，恒卦利于我们坚持一些事或一段关系，但过程都是单向而无利的。'
  },
  巽: {
    num: '110110',
    word: '巽卦，主顺从服从。卦词小亨，利于成事，利于贵人相助。按顺从的特质讲，是偏于阴柔的，利于不暴躁，不激进，不极端，利于心情的随和和调整，但也因为如此，所以缺少激情，没有强大的执念。不利于在艰难的处境中坚持以成事。'
  },
  井: {
    num: '010110',
    word: '井卦，主汲取之理，讲取水的道理，不可涸泽而渔。其引申意为格局受限，眼界受限。所以井卦作为运，更容易让人陷入水平或者认知等比较受局限的状态。对于应卦者，井卦更适合深耕自身，沉下心来牢固基础。而对于扩张和发展，尤其是创业和进取是不利的。'
  },
  蛊: {
    num: '100110',
    word: '蛊卦，主惑乱迷惑，蛊惑人心。所谓蛊为乱之始，剥为乱之极。蛊卦就是混乱和积弊日久的状态。越是如此混乱而方向不明，则越是不利。而卦词虽然利于克服困难，但是只有顺利而未批吉利。蛊作为运卦，其带来的积弊日久和混乱状态对于各方面，尤其是情感关系都是不利的。'
  },
  升: {
    num: '000110',
    word: '升卦，主上升的趋势，但这种上升的趋势是没有逻辑和铺垫的。尽管如此，作为运卦，升卦的意向和卦词都是正向的，所以对于希望积极进取的各个方面是有利的。但是对于求扎下根基，循序渐进的状态，尤其是对于颐养天年的状态而言更为不利。'
  },
  讼: {
    num: '111010',
    word: '讼卦，主争讼争执。作为运卦对抗激烈，过程激进，精神顽强不容易服输。其卦辞中吉，终凶。是应卦者整体运势过程吉利但最终结果不利，其不利涉大川，也是不利于克服困难，所以如果应卦者自身正处困境或想要进行困难的事都不利。'
  },
  困: {
    num: '011010',
    word: '困卦，主困厄，陷入困境难以自拔。这种困境与你本身的强弱无关，是一种抉择两难，进退维谷的状态。卦辞是大人吉。即如果陷入困境以后，其状态仍然是刚烈的，如大丈夫般横刀立马，则有利于应卦者脱离困境取，否则的话，对应卦者是诸事不利的。'
  },
  未济: {
    num: '101010',
    word: '未济卦，主不成事，尚未完成。作为运势更利于过程导向的状态，利于长线项目的初期或筹备，也利于在阶段性节点后开启新的篇章。其卦辞描述的是小狐汔济濡其尾，喻阴沟翻船，细节出错，导致功亏一篑不成事。对于以结果导向的求财或阶段性的事业均不利。'
  },
  解: {
    num: '001010',
    word: '解卦，主柔道致治，解除解决，狭义的也特指解决困难。所以对越是聪明的人，越是有解决问题条件的人越是有利。其卦辞利西南，往来复吉。也就是应卦者越在熟悉的领域或地方越是有利。对于深受疾病或其他困厄围绕的解除也很有利。'
  },
  涣: {
    num: '110010',
    word: '涣卦，主涣散，其也是发展壮大之意，其本意风行水上，其发展的趋势如水一样，是随势随形的，不按计划或者不按既定的想法来发展。卦辞王假有庙，利涉大川，利贞。是利于顺势发展克服困难坚持成事，自有出路。作为运卦利于顺势顺形壮大，若能根据实际环境或条件即使作出调整，则诸事有利。'
  },
  坎: {
    num: '010010',
    word: '坎卦主坑陷，陷阱。作为运卦，无论事业或是情感都存在更多曲折和陷阱，于诸事不利。'
  },
  蒙: {
    num: '100010',
    word: '蒙卦，主蒙昧无知，蛮荒的状态。利于野蛮新生的事物或状态，对于需要偏强硬态度的行业有利，蒙卦卦辞也描述混沌不清的状态，所以对大多数事业或求财均不利，尤其是服务业不利。但利于某些成熟的或畸形的情感状态。'
  },
  师: {
    num: '000010',
    word: '师卦，主军队和战争，征战杀伐。卦辞丈人吉。都是一个非常激烈的对抗状态，作为运卦残暴刚健，勇猛无畏者更有利。应卦者越是男子汉大丈夫的担当和责任心，处事越是凶狠果决，相对有底蕴正道，越是有利。但对于求感情或家庭和睦，尤其是休养生息，身体健康不利。'
  },
  遁: {
    num: '111100',
    word: '遁卦主隐遁退让，保守逃避，是一个往后的收敛状态，可进可退选退，可攻可守选守，就是遁的状态，对一些处事相对保守，不激进。或者说对自身要求不高的人更适合。但就追求结果和及时利益的事业而言，遁卦是不利的。其卦辞小利贞，也是对力所能及更有利，对力所不能及，核心需要依靠他人的也不利。'
  },
  咸: {
    num: '011100',
    word: '咸卦，主感应感觉，也喻指情感尤其是爱情。作为运卦，咸卦更利于做事凭借直觉而非逻辑的人，更有利于感性艺术相关的领域，尤其利于求桃花，追求感情和睦，家庭和谐，尤其利于对真爱有要求的人。但对事业和求财却因为过于感性而不利。'
  },
  旅: {
    num: '101100',
    word: '旅卦，主流离失所，行旅远方，也喻失去归属和依靠。对于越是远离家乡越适合，越是偏离既有状态也越适合，尤其适合是曾经越辉煌而现在又陷入低谷的人。卦辞旅贞吉，也就是在这种颠沛流离，失去依靠的状态中越是坚持越是坚强则越是吉利。但其不利于现在正在走上坡路，尤其是高速发展扩张的人或事。'
  },
  小过: {
    num: '001100',
    word: '小过，主小有过越，以退为进。利于应用策略而非对抗，更有智慧而非蛮力，尤其利于利用规则或者人性的一些灰色行为。而其卦辞也就是以退为进大吉。但小过六爻无吉，其以退为进的过程是非常艰难的，稍有行差踏错就很容易陷入只有退而无可进的局面。其对于正派正直的行业或事物是不利的。'
  },
  渐: {
    num: '110100',
    word: '渐卦，主循序渐进，逐步发展，注意并不是利于最近非要有结果，而是相对自己来说是稳步的进步。也利于稳扎稳打的人或事，渐卦卦辞是描述的出嫁吉祥，喻利于进而取得正位，前往有功，按正道前进，即使停下也能心安的等待。作为运卦，渐卦对求立竿见影结果的事，尤其需要缩短过程快速见效的事物，如赌博不利。'
  },
  蹇: {
    num: '010100',
    word: '蹇卦，主跛足而行，艰难险阻。作为运卦多困难，挫折，病痛等。卦辞利西南不利东北，指利于收缩居家，而不利求前进发展。此卦诸事不利。'
  },
  艮: {
    num: '100100',
    word: '艮卦主停止停滞，适可而止。艮卦不动如山，意静止限制，固执有原则。作为运卦利于刻板传统的行业，相信权威并跟随权威的人更适合，其卦辞也是适可而止。即使到了地方在最后也没有找到人，而喻指也会因为停滞不前而错失很多机会。此卦不利于积极进取尤其不利于创业发展。'
  },
  谦: {
    num: '000100',
    word: '谦卦主谦逊谦让，六爻皆吉。利于谦谦君子状态，越是谦和，真诚的人越有利。但要判断他的谦和的状态是真诚的，而不是以退为进。否则就不是真正的应卦者。其卦辞也是君子有终，也需要一个真诚的前提。谦卦六爻皆吉，以真诚为前提，诸事大吉。'
  },
  否: {
    num: '111000',
    word: '否卦，主不通不顺，作为运卦，诸事不顺利。卦辞不利君子贞，即应卦者越是君子，即越是正派则更加不利。'
  },
  萃: {
    num: '011000',
    word: '萃卦，主荟萃云集，众星捧月。越是大家都围绕宠爱的状态则越是适合。注意和同人的区别，这并不是事业上相互成就的团结，而是一种偏爱。尤其利于服务行业，或者新兴自媒体直播等。也利于求感情和桃花，但要注意甄别和筛选。'
  },
  晋: {
    num: '101000',
    word: '晋卦，主晋升晋级，跃上台阶，也喻指有所成就，建功立业。利于想取得进步，尤其是取得阶段性成绩，阶段性成就的人。卦辞也是讲的建功立业，其整体有利，尤其是利于取得阶段性成果甚至最终成就的。'
  },
  豫: {
    num: '001000',
    word: '豫卦，主安逸乐观，预备准备。其卦辞利建功立业征战讨伐。作为运卦，利于积极备战，准备充分，尤其是目前的事情越是重要，能够所谓建功立业，则越是有利。但豫卦的喜悦是表象的，不仅是表面的光鲜亮丽，还需要付出相当的代价和努力。'
  },
  观: {
    num: '110000',
    word: '观卦，主观瞻仰望，由下往上看。越是虔信，越是心中有信仰，对事物越是热爱和敬畏则越有利。卦辞无吉凶，描述的是一个祭祀过程中应该保持的状态，作为运卦，观卦更淡然，超脱。利于求安逸休闲，健康养生。其对积极进取求事业或求财不利。'
  },
  比: {
    num: '010000',
    word: '比卦主亲密无间，是君临天下，群臣辅之，利强者，利正道，比卦是一个阴盛阳衰的卦，更偏向女性。越是既得利益者，越是拥有地位越高越有利。比卦利于亲密无间的关系，维系客户朋友，尤其对于获取或维护男女情事最为有利。'
  },
  剥: {
    num: '100000',
    word: '剥卦，主剥离分化，自我否定。作为运卦，是混乱到极致的表现，诸事不利。'
  },
  坤: {
    num: '000000',
    word: '坤卦，主博爱付出，利付出而不利获取，作为运卦，诸事不利。尤其不利求财。'
  },
  复: {
    num: '000001',
    word: '复卦，主恢复修复，全新的开始。利于最近状态低迷，希望有所恢复的人。 作为运卦，利于开创新的局面，从事新的领域或者行业，也利于创业。复卦卦词虽反复但有利，虽出入但无疾，总的讲是有利的运势。但是其反复的状态不利于断舍离。'
  },
  颐: {
    num: '100001',
    word: '颐卦，主健康颐养，休养生息。越是不那么进取，越是老成的状态越有利。其卦辞贞吉，应卦者自力更生自给自足则更有利。利于求身体健康，祛除疾病等。对积极进取求事业或求财不利。'
  },
  屯: {
    num: '010001',
    word: '屯卦，主初始艰难，未来美好。对于一些新兴的事物，尤其是底蕴不深，学生或者初入社会的人更有利。对于目前状态而言，出于刚刚好转的艰苦过程的相对也会更有利。其卦辞不利攸往但是又利建侯，比喻为不利于急于求成，而应利于积累反馈在未来有所成。屯卦作为运卦是艰难的，尤其是希望不久后能有所成的更不利。'
  },
  益: {
    num: '110001',
    word: '益卦主增益收益，利于求财，且也包含更为广义的增益，收益。所有积极的，正向的获得，都是所谓增益。所以益卦作为运卦，诸事有利，尤其利于求财求利。'
  },
  震: {
    num: '001001',
    word: '震卦，主震动变动，有惊无险。作为运卦，会使过程都存在比较大的变数，更加多变，新奇而刺激。所以其利于追求新事物，紧随潮流和时尚。利于短时的激情但其不利于求长久的情感，利于一时的快乐但不利于长久的发展。'
  },
  噬嗑: {
    num: '101001',
    word: '噬嗑卦，主犬牙交错，扫除邪祟，清除腐化。对于越是原则性强，越是刚强正派，越是攻击性强的状态越适合。但扫除邪祟，是杀敌一千自损八百，也要付出相应的代价。作为运卦，利于断舍离一些不好的情感或事，尤其利于结束一些诉讼官非。也利于祛除疾病。但是不利于休养生息，也不利于既得保守的守成者。'
  },
  随: {
    num: '011001',
    word: '随卦主跟随追随，从善如流。利于跟随别人的脚步，获取他人的指导或引领。也利于跟随大势所趋，顺势而为。卦辞元亨利贞，对顺势之事皆大吉有利。但不利于逆势而上，从事违背目前大气候的事业，如情感上利于获取爱你的人或事，但难以追求你爱的人或事。'
  },
  无妄: {
    num: '111001',
    word: '无妄卦主勿生妄念，不能妄为，也是多意外事件的卦。作为运卦是诸事不利的。但越是对自己的缺点优点剖析得最到位的，越是有自知之明的人则越不会受无妄的影响。'
  },
  明夷: {
    num: '000101',
    word: '明夷主光明受损，艰难中坚持。作为运卦是时势艰难，诸事不利的。但是明夷是黎明前的黑暗，再是艰难，黎明终有到来的时候，所以明夷也是充满希望的卦，对于已经陷入艰难境地而苦苦支撑的人来说，是有利的。'
  },
  贲: {
    num: '100101',
    word: '贲卦主纹饰文化，文创审美。作为运卦是对诸事有利的卦，但贲卦重审美轻修身，相对肤浅，越是去看上去华丽有场面，或者光鲜漂亮的人越适合。尤其利于从事文化相关领域的发展或事业。但其不利于沉下心深挖积累，尤其不利于科研等纯理性内涵的领域。'
  },
  既济: {
    num: '010101',
    word: '既济卦主已经完成，事业有成，利于已经有一定的底蕴和成绩的人，也利于求得结束或最后的成果，利于进行临门一脚的行为。但其卦词是初吉而终乱，是一开始还不错，越往后走，越容易混乱，这是既济卦的基调，同时也是小人之道，衰世之象。所以如果事业或感情刚开始则应及时修正，既济卦虽然能成，但并非正道。'
  },
  家人: {
    num: '110101',
    word: '家人卦主家和万事兴，也利于内部团结和谐，其卦词为利女贞，是指应卦者要拥有“女性的品质”才有利，所谓女性的品质就是诸如细腻，温柔，包容等特性更有利。作为运卦家人诸事皆吉，但是对于特别激进想付出所有代价拼命一搏的状态不利。'
  },
  丰: {
    num: '001101',
    word: '丰卦主光明盛大，如日中天，利于最近特别强势，状态各种好的人。作为运卦，诸事有利，特别是积极进取的领域，希望取得一些成绩或者利益，都更有利。但如日中天之后必然会盛极而衰，所以丰卦又是忧患之卦，一旦德不配位，必然适得其反，诸事不利。'
  },
  离: {
    num: '101101',
    word: '离卦，主光明附丽，利于积极进取，追求成功，奠定基础，对于越是正能量的状态越有利。卦辞利于坚持，坚韧的积蓄力量。作为运卦，利于求财求事业，也利于追求感情，尤其利于付出一定代价以成事。不利于追求心灵平和或身体健康，尤其不利于祛除疾病。'
  },
  革: {
    num: '011101',
    word: '革卦，主变革革命，鼎故革新。卦词指只要心怀诚信，不忘初心的变革，就是无悔而有利的。作为运而言，革卦对于那些为了进步有变化的人，无论是客观环境的变化，或是主观意愿的变化，甚至是开启新的感情，新的行业等等都更加有利。但对于守成者或者希望求稳而循序渐进的状态则不利。'
  },
  同人: {
    num: '111101',
    word: '同人卦，主团结成事，对于越是团结和谐的状态越有利。卦辞利于克服困难，坚持以成事。作为运，同人卦最利事业。'
  },
  临: {
    num: '000011',
    word: '临卦，主面临来临，临渊弄险。利于即将或者已经取得大成的状态或阶段。但是越是快要收获的时候越是存在隐患，如走在一个存在危险的境地而不自知。所以临卦是弄险的卦，作为运利于快速取得成果，也利于求财，求感情，尤其利于挣快钱和灰色事业。'
  },
  损: {
    num: '100011',
    word: '损卦主减损，蒙受损失。作为运卦仅利于求道，对于最近或者长期来看蒙受减损越重的则越不利，长线来说越来越差，短线来说，近期无法取得好成果或者是会遭受挫折。作为运，虽然其诸事不利，尤其不利求财。但有孚元吉，若能抱定吃亏是福的心态将眼光看得比运更长则大吉。'
  },
  节: {
    num: '010011',
    word: '节卦主节俭节约，克制和压抑自己的欲望。利于渴望比较冷静，理性的人。整体气质而言更加稳重甚至刻板的人或事都更有利。其卦词苦节不可贞，就是指过于的压抑和节制会适得其反而无法长久。作为运，节卦利于各司其职，按部就班，波动小，变化少，收缩克制的状态，也利于断舍离。但不利于积极进取的事业，也不利于求财。'
  },
  中孚: {
    num: '110011',
    word: '中孚卦，主心怀诚信，持身正道。其卦词是利于坚持，利于克服困难成就事情，整体还是偏向有利的。中孚太正，对于越是正派的人，越是正统的事业则越有利。但不利灰色地带或是灰色收入，不利求偏财，也不利求桃花。'
  },
  归妹: {
    num: '001011',
    word: '归妹卦，主婚嫁之事。利于情感相关，利于求桃花，尤其利于婚嫁。卦辞征凶无攸利，除此外，诸事不利，尤其不利远征，不利扩张，主动谋求的事业。'
  },
  睽: {
    num: '101011',
    word: '睽卦主乖离孤独，独善其身。越是如独行者一般的，独一无二的，特殊的存在等，就越是有利。睽卦卦辞小事吉，作为运卦，利于力所能及的事情，越是受自己掌控的越有利。但是不利于深陷困境的状态，也不利克服困难，尤其不利桃花和情感。'
  },
  兑: {
    num: '011011',
    word: '兑卦，主获得喜悦的原因和核心。其卦词顺利，利于坚持，利于对喜悦快乐的追求，也利于功利性并不那么强的，以兴趣和热爱为主导的事业。对情感或健康的追求也偏向有利。但不利于严肃认真，积极进取的人或事，尤其不利于诉讼官非或其他争执。'
  },
  履: {
    num: '111011',
    word: '履卦，主如履薄冰，小心翼翼的行走。利于求贵人相助，得人提携，受人护佑以成事。卦辞描述在老虎后面小心翼翼的跟着，不会被老虎咬。但对于由自己主导，完全靠自己的事不利，尤其不利于冲锋激进之类。'
  },
  泰: {
    num: '000111',
    word: '泰卦，主通主顺。作为运卦，诸事顺利。尤其利于求得时来运转，否极泰来。'
  },
  大畜: {
    num: '100111',
    word: '大畜卦，主厚积薄发，积蓄力量以成事，阳刚的积累，越是通过正向的积累和努力则越有利。尤其对于那些坚持不懈，一步一步积累出来的人或事更有利。但不利求快钱求偏财。'
  },
  需: {
    num: '010111',
    word: '需卦，主等待时机，谋定后动。利于比较有耐性，不急躁，不冒进的人或事。卦辞有孚光亨，所以要求应卦者走正道才更有利，尤其利于谋划或筹备一些重要的事。但对需要积极进取的事不利，也不利求偏财，尤其不利灰色地带。'
  },
  小畜: {
    num: '110111',
    word: '小畜卦，主积蓄而未成，阴柔的积蓄。卦词密云不雨，喻光打雷不下雨，无法造成具体的结果。利于过程的积累，长线的项目，利于潜移默化。对于想及时取得成果的不利，也不利求财，尤其不利以结果为导向的状态。'
  },
  大壮: {
    num: '001111',
    word: ' 大壮卦，主刚强盛大，横刀立马。卦辞利贞指利于坚持。利于激进进取以成事，也利于克服困难，对抗抗争，尤其利于祛除疾病，扫除邪祟。作为运卦，是绝对坚强的，但可能陷入刚愎自用的状态，不利休养生息，心境平和。'
  },
  大有: {
    num: '101111',
    word: '大有卦，主诸事顺遂。卦辞元亨，也是对一切人或事都有利。'
  },
  夬: {
    num: '011111',
    word: '夬卦，主诀别决断，也是君子决小人之意。利于抛弃过去，也利于纠正错误，于断舍离相关之事均有利。除此之外，于诸事不利，尤其不利于需要合作团结的事业。'
  }
}
